; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	image3 - mode
	infrared1 - mode
	image2 - mode
	spectrograph4 - mode
	image0 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	Star2 - direction
	Star4 - direction
	Star3 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Star7 - direction
	Star8 - direction
	Planet9 - direction
	Planet10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Planet13 - direction
	Phenomenon14 - direction
)
(:init
	(supports instrument0 image2)
	(supports instrument0 spectrograph4)
	(supports instrument0 image0)
	(supports instrument0 infrared1)
	(supports instrument0 image3)
	(calibration_target instrument0 Star3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet9)
)
(:goal (and
	(pointing satellite0 GroundStation1)
	(have_image Phenomenon5 image2)
	(have_image Planet6 image2)
	(have_image Star7 image0)
	(have_image Star8 infrared1)
	(have_image Planet9 image2)
	(have_image Planet10 image0)
	(have_image Planet11 image0)
	(have_image Phenomenon12 image2)
	(have_image Planet13 image3)
	(have_image Phenomenon14 image0)
))

)

; plan
1. (turn_to satellite0 star3 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star3)
   goals met: 0 of 11
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 11
3. (calibrate satellite0 instrument0 star3)
   added: (calibrated instrument0)
   goals met: 0 of 11
4. (turn_to satellite0 planet11 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 planet11)
   goals met: 0 of 11
5. (take_image satellite0 planet11 instrument0 image0)
   added: (have_image planet11 image0)
   goals met: 1 of 11
6. (turn_to satellite0 planet10 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet10)
   goals met: 1 of 11
7. (take_image satellite0 planet10 instrument0 image0)
   added: (have_image planet10 image0)
   goals met: 2 of 11
8. (turn_to satellite0 phenomenon5 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 phenomenon5)
   goals met: 2 of 11
9. (take_image satellite0 phenomenon5 instrument0 image2)
   added: (have_image phenomenon5 image2)
   goals met: 3 of 11
10. (turn_to satellite0 phenomenon14 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 phenomenon14)
   goals met: 3 of 11
11. (take_image satellite0 phenomenon14 instrument0 image0)
   added: (have_image phenomenon14 image0)
   goals met: 4 of 11
12. (turn_to satellite0 phenomenon12 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 phenomenon12)
   goals met: 4 of 11
13. (take_image satellite0 phenomenon12 instrument0 image2)
   added: (have_image phenomenon12 image2)
   goals met: 5 of 11
14. (turn_to satellite0 planet13 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 planet13)
   goals met: 5 of 11
15. (take_image satellite0 planet13 instrument0 image3)
   added: (have_image planet13 image3)
   goals met: 6 of 11
16. (turn_to satellite0 planet6 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 planet6)
   goals met: 6 of 11
17. (take_image satellite0 planet6 instrument0 image2)
   added: (have_image planet6 image2)
   goals met: 7 of 11
18. (turn_to satellite0 planet9 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 planet9)
   goals met: 7 of 11
19. (take_image satellite0 planet9 instrument0 image2)
   added: (have_image planet9 image2)
   goals met: 8 of 11
20. (turn_to satellite0 star7 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star7)
   goals met: 8 of 11
21. (take_image satellite0 star7 instrument0 image0)
   added: (have_image star7 image0)
   goals met: 9 of 11
22. (turn_to satellite0 star8 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star8)
   goals met: 9 of 11
23. (take_image satellite0 star8 instrument0 infrared1)
   added: (have_image star8 infrared1)
   goals met: 10 of 11
24. (turn_to satellite0 groundstation1 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 groundstation1)
   goals met: 11 of 11
